{
  "nav": {
    "home": "Home",
    "experience": "Experience",
    "projects": "Projects",
    "certifications": "Certifications",
    "technologies": "Technologies"
  },
  "aboutMe": {
    "title": {
      "1": "Hi there! I'm Gonzalo",
      "2": "Software Developer",
      "3": "Specialized in",
      "4": "and"
    },
    "contact": "Contact Me",
    "download": "Download CV"
  },
  "experience": {
    "title": "Work Experience",
    "freelance": {
      "title": "Freelance Developer",
      "subtitle": "ADINI (Self Employed)",
      "date": "March 2024 - ",
      "dateSpan": "Present",
      "text": "As a freelance developer, I specialize in the design and development of web and mobile applications, committed to delivering results that align with the goals and needs of each project, maintaining clear communication and a proactive approach at every stage of development."
    },
    "developer": {
      "title": "Software Developer",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "February 2024 - ",
      "dateSpan": "Present",
      "text": "As a Full Stack Developer, I specialize in developing applications from scratch, following each stage of the development process accurately. Additionally, I handle the implementation of new features, modules, and functionalities in existing applications. I also focus on resolving errors to optimize performance and enhance the user experience."
    },
    "analyst": {
      "title": "Functional Analyst",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "April 2023 - January 2024",
      "text": "Responsible for analyzing and determining requirements for software development projects. Focused on generating use cases and user stories, as well as creating various diagrams that comprised the analysis and design stages. In addition, I carried out QA testing tasks to guarantee the quality of the developed software."
    },
    "support": {
      "title": "Application Support",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "August 2022 - March 2023",
      "text": "My role consisted of identifying and resolving errors in university applications both from the administrator interface and through database queries when necessary. Additionally, I managed app permissions and kept in touch with users to help them resolve issues."
    }
  },
  "projects": {
    "details": "Details",
    "modal": {
      "challengues": "Challenges",
      "technologies": "Technologies",
      "integrations": "Integrations",
      "gallery": "Gallery"
    },
    "titles": {
      "mobile": "Mobile Projects",
      "web": "Web Projects"
    },
    "movil": {
      "title": "Moviltrack",
      "subtitle": "Enterprise Management System",
      "text": "Administrative web application that allows managing a company's commercial operations. The system includes an analytical dashboard, project management, clients, suppliers, products, and services. It also features modules for quotations, purchase orders, delivery notes, expenses, and recurring billing.",
      "challenges": [
        "Managing two currencies (MXN and USD) along with different exchange rates for the system’s overall administration.",
        "Implementing a real-time PDF generator adaptable to various types of documents.",
        "Developing a system for creating automatic recurring charges.",
        "Building a drag-and-drop system for customizable products used in quote creation.",
        "Designing a dashboard for the different modules, with customizable charts, reports, and reminders."
      ]
    },
    "planner": {
      "title": "Organizer",
      "subtitle": "Task and Note Organizer",
      "text": "A web application designed to organize notes and tasks in a simple and efficient way. It allows you to create different types of notes and tasks, such as actionable, waiting, recurring, and scheduled items, each with specific features to adapt to different needs. It includes a notes editor with Markdown support that helps improve writing and content structure. The application also offers a reminder system that displays the tasks pending for the day.",
      "challenges": [
        "Implementing a text editor with Markdown support.",
        "Designing a shared table structure with specific functionalities depending on the type of note or task."
      ]
    },
    "toon": {
      "title": "Toon Guesser",
      "subtitle": "Character Guessing Game",
      "text": "A web page where users can guess characters from various cartoons. The system displays a black-and-white pixelated image of a character, which gradually gains color and detail as the user makes guesses. A new character is released every day, offering a fresh challenge for users to solve.",
      "challenges": [
        "Design a canvas-based system to apply different levels of pixelation and coloring to the character's image.",
        "Create a session state saving system without using a database or authentication.",
        "Set up a cron job to randomly update characters, avoiding repetition from previous days as long as characters are available."
      ]
    },
    "pap": {
      "title": "Paso a Paso",
      "subtitle": "Wholesale Web Page",
      "text": "Web application developed for a wholesale company, enabling users to browse available products and add them to a cart for request purposes. Additionally, it includes an admin panel to manage products and configure general page settings.",
      "challenges": [
        "Implementing customization features for catalogs, categories, and products from the admin panel.",
        "Developing a file management system to handle product images."
      ]
    },
    "traducciones": {
      "title": "Traducciones",
      "subtitle": "Translation and Proofreading Microservice",
      "text": "Microservice for a university portal, designed to translate and correct files. It manages the uploading and downloading of documents and includes specific roles for each user type. Additionally, it includes an email notification system to keep users informed.",
      "challenges": [
        "Design a microservice architecture in the backend, integrating Keycloak for authentication in communications through the API Gateway.",
        "Develop a file management system for the various documents of each request.",
        "Integrate Keycloak for user and role management."
      ]
    },
    "difusiones": {
      "title": "Diffusions",
      "subtitle": "Bulk Email Sending Microservice",
      "text": "Administrative web microservice designed for a university portal to manage and send mass email campaigns. The system includes recipient list management and a dashboard to monitor the status of each campaign. It also provides tracking capabilities to see which users have opened the emails. The email module features a rich-text editor, file attachments, and scheduling options for automated deliveries.",
      "challenges": [
        "Design a microservice architecture in the backend, integrating Keycloak for authentication in communications through the API Gateway.",
        "Develop a rich text editor with the ability to attach files and schedule mailings.",
        "Create a semaphore system for bulk email sending, optimizing performance and preventing blocks from the email service provider.",
        "Establish a method to track who opened the mailing."
      ]
    },
    "ripadmin": {
      "title": "RIP Admin",
      "subtitle": "RIP Alive Admin Panel",
      "text": "Web application for managing the “RIP Alive” mobile app. It allows administrators to view user information, manage subscription and payment statuses, generate discount coupons, configure products, catalogs, and in-app events, among other functionalities.",
      "challenges": [
        "Develop features for creating and managing products, catalogs, and events within the mobile app.",
        "Design a system for generating and managing discount coupons for users."
      ]
    },
    "ripbene": {
      "title": "RIP Beneficiaries",
      "subtitle": "RIP Alive Beneficiaries Page",
      "text": "A web application designed for beneficiaries assigned by a user in the RIP Alive app to access that user’s legacy information. Beneficiaries can view the people who have assigned them and request access to their data. The request is approved only if the account holder does not respond within the time period they configured, which is interpreted as a sign that the person has passed away. In that case, the beneficiary is granted access to the legacy information the holder previously recorded.",
      "challenges": [
        "Establish a method to link the beneficiary's account with the assignor accounts.",
        "Design a system for requesting access to legacy information, with an approval flow based on the assignor's response time."
      ]
    },
    "ripalive": {
      "title": "RIP Alive",
      "subtitle": "Personal Legacy Application",
      "text": "Mobile application designed to allow users to save all their important information in case of death, to inform family members of their final wishes. Users can store details about what to do with their belongings, key contacts, investments, personal and health information, and more. The app includes a built-in subscription system and a store for purchasing products.",
      "challenges": [
        "Develop a system for subscription acquisition and management through Google Play and the App Store using RevenueCat.",
        "Integrate a payment system for in-app product purchases using Stripe.",
        "Create a real-time notification system to alert users about various events within the app.",
        "Design a referral system with cashback to encourage the acquisition of new users."
      ]
    },
    "credential": {
      "title": "Credencial UTN",
      "subtitle": "Digital Credential Application",
      "text": "Mobile application designed as a digital credential for a university. It allows students to verify their enrollment status with a QR code and provides access to useful information, such as current courses, academic records, and a detailed schedule with class times. It also includes a section to download an enrollment certificate.",
      "challenges": [
        "Integrate the SIU-Guaraní API (Argentina's Academic Management System) to obtain real-time student data.",
        "Design a student validation flow using a temporary, encrypted QR code.",
        "Generate a PDF with the student's academic history in real time.",
        "Integrate authentication with Keycloak through an in-app browser."
      ]
    }
  },
  "certifications": {
    "title": "Certifications",
    "en": {
      "title": "Diploma in Advanced English Studies",
      "place": "Cambridge Institute",
      "date": "1 Dic 2017"
    },
    "fullstack": {
      "title": "Full Stack Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "19 May 2023"
    },
    "dbf": {
      "title": "Database Fundamentals",
      "place": "Universidad Tecnológica Nacional",
      "date": "30 Sep 2022"
    },
    "dbd": {
      "title": "Database Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "27 Oct 2023"
    },
    "react": {
      "title": "Development in React",
      "place": "Universidad Tecnológica Nacional",
      "date": "30 Nov 2023"
    },
    "js": {
      "title": "Development in JavaScript",
      "place": "Universidad Tecnológica Nacional",
      "date": "16 Jun 2023"
    },
    "docker": {
      "title": "Docker and Kubernetes",
      "place": "Universidad Tecnológica Nacional",
      "date": "20 Sep 2024"
    },
    "bootcamp": {
      "title": "Bootcamp UTN Credential",
      "place": "Universidad Tecnológica Nacional",
      "date": "20 Mar 2024"
    }
  },
  "stack": {
    "title": "Technology Stack",
    "subtitle": {
      "1": "Frontend",
      "2": "Backend",
      "3": "Tools",
      "4": "Integrations"
    }
  },
  "footer": {
    "title": "Developed by Gonzalo Suarez"
  }
}