{
  "nav": {
    "home": "Home",
    "experience": "Experience",
    "projects": "Projects",
    "certifications": "Certifications",
    "technologies": "Technologies"
  },
  "aboutMe": {
    "title": {
      "1": "Hi there! I'm Gonzalo",
      "2": "Software Developer",
      "3": "Specialized in",
      "4": "and"
    },
    "contact": "Contact Me",
    "download": "Download CV"
  },
  "experience": {
    "title": "Work Experience",
    "freelance": {
      "title": "Freelance Developer",
      "subtitle": "Self Employed",
      "date": "March 2024 - ",
      "dateSpan": "Present",
      "text": "As a freelance developer, I specialize in the design and development of web and mobile applications, committed to delivering results that align with the goals and needs of each project, maintaining clear communication and a proactive approach at every stage of development."
    },
    "developer": {
      "title": "Software Developer",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "February 2024 - ",
      "dateSpan": "Present",
      "text": "As a Full Stack Developer, I specialize in developing applications from scratch, following each stage of the development process accurately. Additionally, I handle the implementation of new features, modules, and functionalities in existing applications. I also focus on resolving errors to optimize performance and enhance the user experience."
    },
    "analyst": {
      "title": "Functional Analyst",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "April 2023 - January 2024",
      "text": "Responsible for analyzing and determining requirements for software development projects. Focused on generating use cases and user stories, as well as creating various diagrams that comprised the analysis and design stages. In addition, I carried out QA testing tasks to guarantee the quality of the developed software."
    },
    "support": {
      "title": "Application Support",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "August 2022 - March 2023",
      "text": "My role consisted of identifying and resolving errors in university applications both from the administrator interface and through database queries when necessary. Additionally, I managed app permissions and kept in touch with users to help them resolve issues."
    }
  },
  "projects": {
    "mobile": {
      "title": "Mobile Projects"
    },
    "web": {
      "title": "Web Projects"
    },
    "samay": {
      "title": "Samay Wayra",
      "text": "Web page developed for a cabin rental company. It includes a photo gallery and a contact section to make accommodation reservations."
    },
    "poke": {
      "title": "Poke Team",
      "text": "Website that allows users to select Pokémon from a Pokédex to create their own team and view its stats."
    },
    "notes": {
      "title": "Notes App",
      "text": "Web application for creating and managing customizable notes, with user authentication to ensure private access to information."
    },
    "movil": {
      "title": "Moviltrack",
      "text": ""
    },
    "planner": {
      "title": "Organizer",
      "text": ""
    },
    "toon": {
      "title": "Toon Guesser",
      "text": ""
    },
    "pap": {
      "title": "Paso a Paso",
      "text": "Web application developed for a wholesale company, enabling users to browse available products and add them to a cart for request purposes. Additionally, it includes an admin panel to manage products and configure general page settings."
    },
    "traducciones": {
      "title": "Traducciones",
      "text": "Microservice for a university portal, designed to translate and correct files. It manages the uploading and downloading of documents and includes specific roles for each user type. Additionally, it includes an email notification system to keep users informed."
    },
    "difusiones": {
      "title": "Diffusions",
      "text": ""
    },
    "ripadmin": {
      "title": "RIP Admin",
      "text": "Web application for managing the 'RIP Alive' mobile app. It allows administrators to view user information, manage subscription and payment statuses, configure app catalogs, generate discount coupons, and more."
    },
    "ripbene": {
      "title": "RIP Beneficiaries",
      "text": ""
    },
    "ripalive": {
      "title": "RIP Alive",
      "text": "Mobile application designed to allow users to save all their important information in case of death, to inform family members of their final wishes. Users can store details about what to do with their belongings, key contacts, investments, personal and health information, and more. The app includes a built-in subscription system and a store for purchasing products."
    },
    "credential": {
      "title": "Credencial UTN",
      "text": "Mobile application designed as a digital credential for a university. It allows students to verify their enrollment status with a QR code and provides access to useful information, such as current courses, academic records, and a detailed schedule with class times. It also includes a section to download an enrollment certificate."
    },
    "amigoscole": {
      "title": "Amigos del Cole",
      "text": "Mobile application designed as a digital wallet for students, where parents can load money into their children's accounts for school. The app allows students to make purchases in school cafeterias using a QR code. It includes three user roles: parent accounts to manage balance and monitor transactions, student accounts to make purchases, and cafeteria accounts to manage received payments."
    }
  },
  "certifications": {
    "title": "Certifications",
    "en": {
      "title": "Diploma in Advanced English Studies",
      "place": "Cambridge Institute",
      "date": "1 Dic 2017"
    },
    "fullstack": {
      "title": "Full Stack Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "19 May 2023"
    },
    "dbf": {
      "title": "Database Fundamentals",
      "place": "Universidad Tecnológica Nacional",
      "date": "27 Oct 2023"
    },
    "dbd": {
      "title": "Database Diploma",
      "place": "Universidad Tecnológica Nacional",
      "date": "27 Oct 2023"
    },
    "react": {
      "title": "Development in React",
      "place": "Universidad Tecnológica Nacional",
      "date": "30 Nov 2023"
    },
    "js": {
      "title": "Development in JavaScript",
      "place": "Universidad Tecnológica Nacional",
      "date": "16 Jun 2023"
    },
    "docker": {
      "title": "Docker and Kubernetes",
      "place": "Universidad Tecnológica Nacional",
      "date": "7 Nov 2024"
    },
    "bootcamp": {
      "title": "Bootcamp UTN Credential",
      "place": "Universidad Tecnológica Nacional",
      "date": "20 Mar 2024"
    }
  },
  "stack": {
    "title": "Technology Stack",
    "subtitle": {
      "1": "Frontend",
      "2": "Backend",
      "3": "Tools",
      "4": "Integrations"
    }
  },
  "footer": {
    "title": "Developed by Gonzalo Suarez"
  }
}
