{
  "nav": {
    "home": "Inicio",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "certifications": "Certificaciones",
    "technologies": "Tecnologías"
  },
  "aboutMe": {
    "title": {
      "1": "¡Hola! Soy Gonzalo",
      "2": "Desarrollador de Software",
      "3": "Especializado en",
      "4": "y"
    },
    "contact": "Contáctame",
    "download": "Descargar CV"
  },
  "experience": {
    "title": "Experiencia Laboral",
    "freelance": {
      "title": "Desarrollador Freelance",
      "subtitle": "Autónomo",
      "date": "Marzo 2024 - ",
      "dateSpan": "Actualidad",
      "text": "Como desarrollador freelance, me especializo en el diseño y desarrollo de aplicaciones web y móviles, comprometido con ofrecer resultados que se alineen con los objetivos y necesidades de cada proyecto, manteniendo una comunicación clara y un enfoque proactivo en cada etapa del desarrollo."
    },
    "developer": {
      "title": "Desarrollador de Software",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "Febrero 2024 - ",
      "dateSpan": "Actualidad",
      "text": "Como desarrollador Full Stack, me especializo en el desarrollo de aplicaciones desde cero, cumpliendo con precisión cada etapa del proceso de desarrollo. Además, me encargo de implementar nuevas características, módulos y funcionalidades en las aplicaciones existentes. También me dedico a resolver errores con el fin de optimizar el rendimiento y mejorar la experiencia del usuario."
    },
    "analyst": {
      "title": "Analista Funcional",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "Abril 2023 - Enero 2024",
      "text": "Encargado del análisis y relevamiento de requisitos para proyectos de desarrollo de software. Enfocado en la generación de casos de uso e historias de usuario, así como en la creación de diversos diagramas que conformaban las etapas de análisis y diseño. Además, realizaba tareas de testing QA para garantizar la calidad del software desarrollado."
    },
    "support": {
      "title": "Soporte Aplicaciones",
      "subtitle": "Universidad Tecnológica Nacional",
      "date": "Agosto 2022 - Marzo 2023",
      "text": "Mi rol consistía en identificar y resolver errores en las aplicaciones universitarias tanto desde la interfaz de administrador como mediante consultas en las bases de datos en caso de ser necesario. Además, gestionaba los permisos de las aplicaciones y mantenía contacto con los usuarios para asistirlos en la resolución de problemas."
    }
  },
  "projects": {
    "details": "Detalles",
    "modal": {
      "challengues": "Desafíos",
      "technologies": "Tecnologías",
      "integrations": "Integraciones",
      "gallery": "Galería"
    },
    "titles": {
      "mobile": "Proyectos Móviles",
      "web": "Proyectos Web"
    },
    "movil": {
      "title": "Moviltrack",
      "subtitle": "Sistema de Gestión Empresarial",
      "text": "Aplicación web administrativa que permite gestionar las operaciones comerciales de una empresa. El sistema cuenta con un panel de control analítico, gestión de proyectos, clientes, proveedores, productos y servicios. Incluye módulos para cotizaciones, órdenes de compra, remisiones, gastos y facturación recurrente.",
      "challenges": [
        "Gestionar dos divisas (MXN y USD) junto con diferentes tipos de cambio para la administración general del sistema.",
        "Implementar un generador de PDFs en tiempo real adaptable a distintos tipos de documentos.",
        "Desarrollar un sistema de creación de cobros recurrentes automáticos.",
        "Crear un sistema de Drag and Drop de productos personalizables para la creación de cotizaciones.",
        "Diseñar un dashboard para los distintos módulos, con gráficos, informes y recordatorios personalizables."
      ]
    },
    "planner": {
      "title": "Organizador",
      "subtitle": "Organizador de Tareas y Notas",
      "text": "Aplicación web diseñada para organizar notas y tareas de manera simple y eficiente. Permite crear distintos tipos de notas y tareas, como ejecutables, en espera, recurrentes o programadas, cada una con funcionalidades específicas para adaptarse a diferentes necesidades. Incluye un editor de notas con soporte para Markdown que facilita una mejor redacción y estructuración del contenido. La aplicación también ofrece un sistema de recordatorios que muestra las tareas pendientes del día.",
      "challenges": [
        "Implementar un editor de texto con soporte para Markdown.",
        "Diseñar una estructura de tablas compartida, con funcionalidades específicas según el tipo de nota o tarea."
      ]
    },
    "toon": {
      "title": "Toon Guesser",
      "subtitle": "Juego de Adivinanza de Personajes",
      "text": "Página web donde los usuarios pueden adivinar personajes de distintos dibujos animados. El sistema muestra una imagen pixelada en blanco y negro de un personaje, que va ganando color y detalle a medida que el usuario realiza sus intentos. Cada día se publica un nuevo personaje, ofreciendo un desafío fresco para resolver.",
      "challenges": [
        "Diseñar un sistema de imagen basado en canvas para aplicar distintos niveles de pixelado y coloración a la imagen del personaje.",
        "Crear un sistema de guardado del estado de la sesión sin necesidad de base de datos ni autenticación.",
        "Configurar un cron que actualice aleatoriamente los personajes, evitando repetir los de días anteriores siempre que queden personajes disponibles."
      ]
    },
    "pap": {
      "title": "Paso a Paso",
      "subtitle": "Página Web Mayorista",
      "text": "Aplicación web desarrollada para una empresa mayorista, permite visualizar los productos disponibles y añadirlos a un carrito para realizar consultas. Además, incluye un panel de administrador para gestionar productos y configurar aspectos generales de la página.",
      "challenges": [
        "Implementar funcionalidades de personalización de catálogos, categorías y productos desde el panel de administración.",
        "Desarrollar un sistema de gestión de archivos para administrar las imágenes de los productos."
      ]
    },
    "traducciones": {
      "title": "Traducciones",
      "subtitle": "Microservicio de Traducción y Corrección",
      "text": "Microservicio para un portal universitario, diseñado para traducir y corregir archivos. Gestiona la carga y descarga de documentos y cuenta con roles específicos para cada tipo de usuario. Además, incluye un sistema de notificación por correo electrónico para mantener a los usuarios informados.",
      "challenges": [
        "Diseñar una arquitectura de microservicio en el backend, integrando Keycloak para la autenticación en las comunicaciones a través del API Gateway.",
        "Desarrollar un sistema de gestión de archivos para los distintos documentos de cada solicitud.",
        "Integrar Keycloak para la gestión de usuarios y roles."
      ]
    },
    "difusiones": {
      "title": "Difusiones",
      "subtitle": "Microservicio de Envío Masivo de Correos",
      "text": "Microservicio para un portal universitario, encargado del envío masivo de difusiones por correo electrónico. El sistema permite gestionar listas de destinatarios, monitorear el estado de cada difusión desde un panel de control y visualizar quién abrió los correos enviados. Además, incluye un editor de texto enriquecido, opción de adjuntar archivos y programación de envíos.",
      "challenges": [
        "Diseñar una arquitectura de microservicio en el backend, integrando Keycloak para la autenticación en las comunicaciones a través del API Gateway.",
        "Desarrollar un editor de texto enriquecido con funcionalidad de adjuntar archivos y programar envíos.",
        "Crear un sistema de semáforos para el envío masivo de correos, optimizando el rendimiento y evitando bloqueos por parte del proveedor de servicios de correo.",
        "Establecer un método para detectar quién abrió la difusión."
      ]
    },
    "ripadmin": {
      "title": "RIP Admin",
      "subtitle": "Panel de Administración RIP Alive",
      "text": "Aplicación web para la gestión de la app móvil “RIP Alive”. Permite a los administradores visualizar información de los usuarios, gestionar estados de suscripción y pagos, generar cupones de descuento, configurar productos, catálogos y eventos de la app, entre otras funcionalidades.",
      "challenges": [
        "Desarrollar funcionalidades para la creación y gestión de productos, catálogos y eventos dentro de la aplicación móvil.",
        "Diseñar un sistema para la generación y administración de cupones de descuento para los usuarios."
      ]
    },
    "ripbene": {
      "title": "RIP Beneficiarios",
      "subtitle": "Página de Beneficiarios RIP Alive",
      "text": "Aplicación web diseñada para que los beneficiarios asignados por un usuario en la app RIP Alive puedan acceder a la información de legado de este último. Los beneficiarios pueden visualizar a las personas que los han asignado y solicitar acceso a sus datos. La solicitud se aprueba únicamente si el titular no responde dentro del período de tiempo que haya configurado, interpretándose que la persona ha fallecido. En ese caso, el beneficiario obtiene acceso a la información de legado que el titular dejó registrada.",
      "challenges": [
        "Establecer un método para vincular la cuenta del beneficiario con los titulares que lo han asignado.",
        "Diseñar un sistema de solicitudes de acceso a la información de legado, con un flujo de aprobación basado en el tiempo de respuesta del titular."
      ]
    },
    "ripalive": {
      "title": "RIP Alive",
      "subtitle": "Aplicación de Legado Personal",
      "text": "Aplicación móvil diseñada para permitir a los usuarios guardar su información importante en caso de fallecimiento, con el fin de informar a sus familiares sobre sus últimos deseos. Los usuarios pueden almacenar detalles sobre qué hacer con sus pertenencias, contactos clave, inversiones, información personal y de salud, entre otros. La app cuenta con un sistema de suscripción de pago y una tienda con productos.",
      "challenges": [
        "Implementar un sistema de adquisición y gestión de suscripciones a través de Google Play y App Store utilizando RevenueCat.",
        "Integrar un sistema de pagos para la compra de productos dentro de la aplicación mediante Stripe.",
        "Crear un sistema de notificaciones en tiempo real para alertar sobre distintos eventos dentro de la aplicación.",
        "Diseñar un sistema de referidos con cashback para incentivar la incorporación de nuevos usuarios."
      ]
    },
    "credential": {
      "title": "Credencial UTN",
      "subtitle": "Aplicación de Credencial Digital",
      "text": "Aplicación móvil diseñada como credencial digital para una universidad. Permite a los estudiantes validarse como alumnos mediante un código QR y facilita el acceso a información útil, como las materias en curso, el historial académico y una agenda detallada con los horarios de cada asignatura. También incluye una sección para descargar la constancia de alumno.",
      "challenges": [
        "Diseñar un flujo de validación de alumnos mediante un código QR temporal y encriptado.",
        "Integrar autenticación con Keycloak a través de un navegador integrado en la aplicación.",
        "Generar en tiempo real un PDF con el historial académico del alumno.",
        "Integrar la API de SIU-Guaraní (Sistema de Gestión Académica de Argentina) para obtener datos en tiempo real sobre los estudiantes."
      ]
    }
  },
  "certifications": {
    "title": "Certificaciones",
    "en": {
      "title": "Diploma en Estudios Superiores de Inglés",
      "place": "Instituto Cambridge",
      "date": "1 Dic 2017"
    },
    "fullstack": {
      "title": "Diplomatura Full Stack",
      "place": "Universidad Tecnológica Nacional",
      "date": "19 May 2023"
    },
    "dbf": {
      "title": "Fundamentos Bases de Datos",
      "place": "Universidad Tecnológica Nacional",
      "date": "30 Sep 2022"
    },
    "dbd": {
      "title": "Diplomatura Bases de Datos",
      "place": "Universidad Tecnológica Nacional",
      "date": "27 Oct 2023"
    },
    "react": {
      "title": "Desarrollo en React",
      "place": "Universidad Tecnológica Nacional",
      "date": "30 Nov 2023"
    },
    "js": {
      "title": "Desarrollo en JavaScript",
      "place": "Universidad Tecnológica Nacional",
      "date": "16 Jun 2023"
    },
    "docker": {
      "title": "Docker y Kubernetes",
      "place": "Universidad Tecnológica Nacional",
      "date": "7 Nov 2024"
    },
    "bootcamp": {
      "title": "Bootcamp Credencial UTN",
      "place": "Universidad Tecnológica Nacional",
      "date": "20 Mar 2024"
    }
  },
  "stack": {
    "title": "Stack Tecnológico",
    "subtitle": {
      "1": "Frontend",
      "2": "Backend",
      "3": "Herramientas",
      "4": "Integraciones"
    }
  },
  "footer": {
    "title": "Desarrollado por Gonzalo Suarez"
  }
}